# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstrainedHandle..::..IsValid Method
RebarConstrainedHandle Class See Also
---
Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace